session/session.org
* CodeQL Workshop --- Using Data-Flow and Range Analysis to Find Out-Of-Bounds Accesses
:PROPERTIES:
:CUSTOM_ID: codeql-workshop--using-data-flow-and-range-analysis-to-find-out-of-bounds-accesses
:END:
* Acknowledgments
  :PROPERTIES:
  :CUSTOM_ID: acknowledgments
  :END:

This session-based workshop is based on the exercise/unit-test-based material at
https://github.com/kraiouchkine/codeql-workshop-runtime-values-c, which in turn is
based on a significantly simplified and modified version of the
[[https://github.com/github/codeql-coding-standards/blob/main/c/common/src/codingstandards/c/OutOfBounds.qll][OutOfBounds.qll library]] from the
[[https://github.com/github/codeql-coding-standards][CodeQL Coding Standards
repository]]. 

* Setup Instructions
  :PROPERTIES:
  :CUSTOM_ID: setup-instructions
  :END:
- Install [[https://code.visualstudio.com/][Visual Studio Code]].

- Install the
  [[https://codeql.github.com/docs/codeql-for-visual-studio-code/setting-up-codeql-in-visual-studio-code/][CodeQL extension for Visual Studio Code]].

- Install the latest version of the
  [[https://github.com/github/codeql-cli-binaries/releases][CodeQL CLI]].

- Clone this repository:
  #+begin_src sh
  git clone https://github.com/hohn/codeql-workshop-runtime-values-c
  #+end_src

- Install the CodeQL pack dependencies using the command
  =CodeQL: Install Pack Dependencies= and select =exercises=,
  =solutions=, =exercises-tests=, =session=, =session-db= and
  =solutions-tests= from the list of packs.

- If you have CodeQL on your PATH, build the database using
  =build-database.sh= and load the database with the VS Code CodeQL
  extension. It is at =session-db/cpp-runtime-values-db=.

  - Alternatively, you can download
    [[https://drive.google.com/file/d/1N8TYJ6f4E33e6wuyorWHZHVCHBZy8Bhb/view?usp=sharing][this
    pre-built database]].

- If you do *not* have CodeQL on your PATH, build the database using the
  unit test sytem. Choose the =TESTING= tab in VS Code, run the
  =session-db/DB/db.qlref= test. The test will fail, but it leaves a
  usable CodeQL database in =session-db/DB/DB.testproj=.

- ❗Important❗: Run =initialize-qltests.sh= to initialize the tests.
  Otherwise, you will not be able to run the QLTests in
  =exercises-tests=.

* Introduction
  :PROPERTIES:
  :CUSTOM_ID: introduction
  :END:
This workshop focuses on analyzing and relating two values --- array
access indices and memory allocation sizes --- in order to identify
simple cases of out-of-bounds array accesses.

The following snippets demonstrate how an out-of-bounds array access can
occur:

#+begin_src cpp
char* buffer = malloc(10);
buffer[9] = 'a'; // ok
buffer[10] = 'b'; // out-of-bounds
#+end_src

A more complex example:

#+begin_src cpp
char* buffer;
if(rand() == 1) {
    buffer = malloc(10);
}
else {
    buffer = malloc(11);
}
size_t index = 0;
if(rand() == 1) {
    index = 10;
}
buffer[index]; // potentially out-of-bounds depending on control-flow
#+end_src

Another common case /not/ covered in this introductory workshop involves
loops, as follows:

#+begin_src cpp
int elements[5];
for (int i = 0; i <= 5; ++i) {
    elements[i] = 0;
}
#+end_src

To find these issues, we can implement an analysis that tracks the upper
or lower bounds on an expression and, combined with data-flow analysis
to reduce false-positives, identifies cases where the index of the array
results in an access beyond the allocated size of the buffer.

* A Note on the Scope of This Workshop
  :PROPERTIES:
  :CUSTOM_ID: a-note-on-the-scope-of-this-workshop
  :END:
This workshop is not intended to be a complete analysis that is useful
for real-world cases of out-of-bounds analyses for reasons including but
not limited to:

- Missing support for loops and recursion
- No interprocedural analysis
- Missing size calculation of arrays where the element size is not 1
- No support for pointer arithmetic or in general, operations other than
  addition and subtraction
- Overly specific modelling of a buffer access as an array expression

The goal of this workshop is rather to demonstrate the building blocks
of analyzing run-time values and how to apply those building blocks to
modelling a common class of vulnerability. A more comprehensive and
production-appropriate example is the
[[https://github.com/github/codeql-coding-standards/blob/main/c/common/src/codingstandards/c/OutOfBounds.qll][OutOfBounds.qll
library]] from the
[[https://github.com/github/codeql-coding-standards][CodeQL Coding
Standards repository]].

* Session/Workshop notes
  :PROPERTIES:
  :CUSTOM_ID: sessionworkshop-notes
  :END:

Unlike the the [[../README.md#org3b74422][exercises]] which use the /collection/ of test problems in
=exercises-test=, this workshop is a sequential session as one following the
actual process of writing CodeQL: use a /single/ database built from a single,
larger segment of code.  For this workshop, the larger segment is still simplified
skeleton code, not a full source code repository.

** Step 1
   :PROPERTIES:
   :CUSTOM_ID: exercise-1
   :END:
   In the first step we are going to start by
   1. modelling a dynamic allocation with =malloc= and
   2. an access to that allocated buffer with an
   3. array expression.

   The goal of this exercise is to then output the array access, buffer, array size,
   and buffer offset.

   The focus here is on
   : void test_const(void)
   and
   : void test_const_var(void)
   in [[file:~/local/codeql-workshop-runtime-values-c/session-db/DB/db.c][db.c]].

*** Hints
    :PROPERTIES:
    :CUSTOM_ID: hints
    :END:
1. =Expr::getValue()::toInt()= can be used to get the integer value of a
   constant expression.

*** Solution
   #+BEGIN_SRC java :tangle example1.ql
     import cpp
     import semmle.code.cpp.dataflow.DataFlow

     from AllocationExpr buffer, ArrayExpr access, int bufferSize, int accessIdx, Expr allocSizeExpr
     where
       // malloc (100)
       // ^^^^^^  AllocationExpr buffer
       //
       // buf[...]
       // ^^^  ArrayExpr access
       //
       // buf[...]
       //     ^^^  int accessIdx
       //
       accessIdx = access.getArrayOffset().getValue().toInt() and
       //
       // malloc (100)
       //         ^^^ allocSizeExpr / bufferSize
       //
       allocSizeExpr = buffer.(Call).getArgument(0) and
       bufferSize = allocSizeExpr.getValue().toInt()
     select buffer, access, accessIdx, access.getArrayOffset(), bufferSize, allocSizeExpr
   #+END_SRC

This produces 12 results, with some cross-function pairs.

** Step 2
The previous query fails to connect the =malloc= calls with the array accesses,
and =mallocs= from one function are paired with accesses in another.

To address these, take the query from the previous exercise and
1. connect the allocation(s) with the
2. array accesses

*** Hints
    :PROPERTIES:
    :CUSTOM_ID: hints
    :END:
1. Use =DataFlow::localExprFlow()= to relate the allocated buffer to the
   array base.
2. The the array base is the =buf= part of =buf[0]=.  Use the 
   =Expr.getArrayBase()= predicate.

