session/session.md
- [CodeQL Workshop &#x2014; Using Data-Flow and Range Analysis to Find Out-Of-Bounds Accesses](#codeql-workshop--using-data-flow-and-range-analysis-to-find-out-of-bounds-accesses)
- [Acknowledgments](#acknowledgments)
- [Setup Instructions](#setup-instructions)
- [Introduction](#introduction)
- [A Note on the Scope of This Workshop](#a-note-on-the-scope-of-this-workshop)
- [Session/Workshop notes](#sessionworkshop-notes)
  - [Step 1](#exercise-1)
    - [Hints](#hints)
    - [Solution](#org8ca1443)
  - [Step 2](#org6138b3d)
    - [Hints](#hints)
    - [Solution](#org287ad06)
    - [Results](#org4b8509f)
  - [Step 3](#exercise-2)
    - [Solution](#orga37db88)
    - [Results](#org22d1a25)
  - [Step 4](#org493babd)
    - [Hint](#org57d9881)
    - [Solution](#org9303851)
    - [Results](#org9ba681e)
  - [Step 5 &#x2013; SimpleRangeAnalysis](#orgda84218)
    - [Solution](#orgb5a7df0)
    - [Results](#orgf04ac53)
  - [Step 6](#orgd9ab97c)
    - [Solution](#org79d9ce3)
    - [Results](#org00d27a6)
  - [Step 7](#org4bfd9c3)
    - [Solution:](#orgf500bdf)
    - [Results](#org07a41ff)
  - [Step 8](#orgd642b5f)
    - [Solution:](#org696e813)
    - [Results](#org77abe31)
  - [Interim notes](#org03ebd84)
  - [Step 9 &#x2013; GlobalValueNumbering](#org29bb594)
    - [interim](#orgfc8f904)
    - [interim](#org53cf2e1)
  - [hashcons](#org7ccef88)


<a id="codeql-workshop--using-data-flow-and-range-analysis-to-find-out-of-bounds-accesses"></a>

# CodeQL Workshop &#x2014; Using Data-Flow and Range Analysis to Find Out-Of-Bounds Accesses


<a id="acknowledgments"></a>

# Acknowledgments

This session-based workshop is based on the exercise/unit-test-based material at <https://github.com/kraiouchkine/codeql-workshop-runtime-values-c>, which in turn is based on a significantly simplified and modified version of the [OutOfBounds.qll library](https://github.com/github/codeql-coding-standards/blob/main/c/common/src/codingstandards/c/OutOfBounds.qll) from the [CodeQL Coding Standards repository](https://github.com/github/codeql-coding-standards).


<a id="setup-instructions"></a>

# Setup Instructions

-   Install [Visual Studio Code](https://code.visualstudio.com/).

-   Install the [CodeQL extension for Visual Studio Code](https://codeql.github.com/docs/codeql-for-visual-studio-code/setting-up-codeql-in-visual-studio-code/).

-   Install the latest version of the [CodeQL CLI](https://github.com/github/codeql-cli-binaries/releases).

-   Clone this repository:
    
    ```sh
    git clone https://github.com/hohn/codeql-workshop-runtime-values-c
    ```

-   Install the CodeQL pack dependencies using the command `CodeQL: Install Pack Dependencies` and select `exercises`, `solutions`, `exercises-tests`, `session`, `session-db` and `solutions-tests` from the list of packs.

-   If you have CodeQL on your PATH, build the database using `build-database.sh` and load the database with the VS Code CodeQL extension. It is at `session-db/cpp-runtime-values-db`.
    -   Alternatively, you can download [this pre-built database](https://drive.google.com/file/d/1N8TYJ6f4E33e6wuyorWHZHVCHBZy8Bhb/view?usp=sharing).

-   If you do **not** have CodeQL on your PATH, build the database using the unit test sytem. Choose the `TESTING` tab in VS Code, run the `session-db/DB/db.qlref` test. The test will fail, but it leaves a usable CodeQL database in `session-db/DB/DB.testproj`.

-   ❗Important❗: Run `initialize-qltests.sh` to initialize the tests. Otherwise, you will not be able to run the QLTests in `exercises-tests`.


<a id="introduction"></a>

# Introduction

This workshop focuses on analyzing and relating two values &#x2014; array access indices and memory allocation sizes &#x2014; in order to identify simple cases of out-of-bounds array accesses.

The following snippets demonstrate how an out-of-bounds array access can occur:

```cpp
char* buffer = malloc(10);
buffer[9] = 'a'; // ok
buffer[10] = 'b'; // out-of-bounds
```

A more complex example:

```cpp
char* buffer;
if(rand() == 1) {
    buffer = malloc(10);
}
else {
    buffer = malloc(11);
}
size_t index = 0;
if(rand() == 1) {
    index = 10;
}
buffer[index]; // potentially out-of-bounds depending on control-flow
```

Another common case *not* covered in this introductory workshop involves loops, as follows:

```cpp
int elements[5];
for (int i = 0; i <= 5; ++i) {
    elements[i] = 0;
}
```

To find these issues, we can implement an analysis that tracks the upper or lower bounds on an expression and, combined with data-flow analysis to reduce false-positives, identifies cases where the index of the array results in an access beyond the allocated size of the buffer.


<a id="a-note-on-the-scope-of-this-workshop"></a>

# A Note on the Scope of This Workshop

This workshop is not intended to be a complete analysis that is useful for real-world cases of out-of-bounds analyses for reasons including but not limited to:

-   Missing support for loops and recursion
-   No interprocedural analysis
-   Missing size calculation of arrays where the element size is not 1
-   No support for pointer arithmetic or in general, operations other than addition and subtraction
-   Overly specific modelling of a buffer access as an array expression

The goal of this workshop is rather to demonstrate the building blocks of analyzing run-time values and how to apply those building blocks to modelling a common class of vulnerability. A more comprehensive and production-appropriate example is the [OutOfBounds.qll library](https://github.com/github/codeql-coding-standards/blob/main/c/common/src/codingstandards/c/OutOfBounds.qll) from the [CodeQL Coding Standards repository](https://github.com/github/codeql-coding-standards).


<a id="sessionworkshop-notes"></a>

# Session/Workshop notes

Unlike the the [exercises](../README.md#org3b74422) which use the *collection* of test problems in `exercises-test`, this workshop is a sequential session following the actual process of writing CodeQL: use a *single* database built from a single, larger segment of code and inspect the query results as you write the query.

For this workshop, the larger segment of code is still simplified skeleton code, not a full source code repository.

The queries are embedded in \`session.md\` but can also be found in the \`example\*.ql\` files. They can all be run as test cases in VS Code.


<a id="exercise-1"></a>

## Step 1

In the first step we are going to

1.  identify a dynamic allocation with `malloc` and
2.  an access to that allocated buffer. The access is via an array expression; we are **not** going to cover pointer dereferencing.

The goal of this exercise is to then output the array access, array size, buffer, and buffer offset.

The focus here is on

    void test_const(void)

and

    void test_const_var(void)

in [db.c](file:///Users/hohn/local/codeql-workshop-runtime-values-c/session-db/DB/db.c).


<a id="hints"></a>

### Hints

1.  `Expr::getValue()::toInt()` can be used to get the integer value of a constant expression.


<a id="org8ca1443"></a>

### Solution

```java
import cpp
import semmle.code.cpp.dataflow.DataFlow

from AllocationExpr buffer, ArrayExpr access, int bufferSize, int accessIdx, Expr allocSizeExpr
where
  // malloc (100)
  // ^^^^^^  AllocationExpr buffer
  //
  // buf[...]
  // ^^^  ArrayExpr access
  //
  // buf[...]
  //     ^^^  int accessIdx
  //
  accessIdx = access.getArrayOffset().getValue().toInt() and
  //
  // malloc (100)
  //         ^^^ allocSizeExpr / bufferSize
  //
  allocSizeExpr = buffer.(Call).getArgument(0) and
  bufferSize = allocSizeExpr.getValue().toInt()
select buffer, access, accessIdx, access.getArrayOffset(), bufferSize, allocSizeExpr
```

This produces 12 results, with some cross-function pairs.


<a id="org6138b3d"></a>

## Step 2

The previous query fails to connect the `malloc` calls with the array accesses, and in the results, `mallocs` from one function are paired with accesses in another.

To address these, take the query from the previous exercise and

1.  connect the allocation(s) with the
2.  array accesses


<a id="hints"></a>

### Hints

1.  Use `DataFlow::localExprFlow()` to relate the allocated buffer to the array base.
2.  The the array base is the `buf` part of `buf[0]`. Use the `Expr.getArrayBase()` predicate.
