session/session.org
*** Solution

    #+BEGIN_SRC java :tangle example2.ql
      import cpp
      import semmle.code.cpp.dataflow.DataFlow

      // Step 2
      // void test_const(void)
      // void test_const_var(void)
      from AllocationExpr buffer, ArrayExpr access, int bufferSize, int accessIdx, Expr allocSizeExpr
      where
        // malloc (100)
        // ^^^^^^  AllocationExpr buffer
        //
        // buf[...]
        // ^^^  ArrayExpr access
        //
        // buf[...]
        //     ^^^  int accessIdx
        //
        accessIdx = access.getArrayOffset().getValue().toInt() and
        //
        // malloc (100)
        //         ^^^ allocSizeExpr / bufferSize
        //
        allocSizeExpr = buffer.(Call).getArgument(0) and
        bufferSize = allocSizeExpr.getValue().toInt() and
        // char *buf  = ... buf[0];
        //       ^^^  --->  ^^^
        // or
        // malloc(100);   buf[0]
        // ^^^  --------> ^^^
        //
        DataFlow::localExprFlow(buffer, access.getArrayBase())
      select buffer, access, accessIdx, access.getArrayOffset(), bufferSize, allocSizeExpr
    #+END_SRC

*** Results
    There are now 3 results.  These are from only one function, the one using constants.

** Step 3
   :PROPERTIES:
   :CUSTOM_ID: exercise-2
   :END:

   The previous results need to be extended to the case
   #+BEGIN_SRC c++
     void test_const_var(void)
     {
         unsigned long size = 100;
         char *buf = malloc(size);
         buf[0];        // COMPLIANT
         ...
     }
   #+END_SRC

   Here, the =malloc= argument is a variable with known value.  

   We include this result by removing the size-retrieval from the prior query.

*** Solution

    #+BEGIN_SRC java :tangle example3.ql

      import cpp
      import semmle.code.cpp.dataflow.DataFlow

      // Step 3
      // void test_const_var(void)
      from AllocationExpr buffer, ArrayExpr access, int accessIdx, Expr allocSizeExpr
      where
        // malloc (100)
        // ^^^^^^  AllocationExpr buffer
        //
        // buf[...]
        // ^^^  ArrayExpr access
        //
        // buf[...]
        //     ^^^  int accessIdx
        //
        accessIdx = access.getArrayOffset().getValue().toInt() and
        //
        // malloc (100)
        //         ^^^ allocSizeExpr / bufferSize
        //
        allocSizeExpr = buffer.(Call).getArgument(0) and
        // bufferSize = allocSizeExpr.getValue().toInt() and
        // char *buf  = ... buf[0];
        //       ^^^  --->  ^^^
        // or
        // malloc(100);   buf[0]
        // ^^^  --------> ^^^
        //
        DataFlow::localExprFlow(buffer, access.getArrayBase())
      select buffer, access, accessIdx, access.getArrayOffset() 
    #+END_SRC

*** Results
    Now, we get 12 results, including some from other test cases.

** Step 4
   We are looking for out-of-bounds accesses, so we to need to include the
   bounds.  But in a different way.

   Note the results for the cases in =test_const_var= which involve a variable
   access rather than a constant. The next goal is to handle the case where the
   allocation size or array index are variables (with constant values) rather than
   integer constants.

   We have an expression =size= that flows into the =malloc()= call.
   
*** Solution

    #+BEGIN_SRC java :tangle example4.ql
      import cpp
      import semmle.code.cpp.dataflow.DataFlow

      // Step 4
      from AllocationExpr buffer, ArrayExpr access, int accessIdx, Expr allocSizeExpr, int bufferSize, Expr bse
      where
        // malloc (100)
        // ^^^^^^^^^^^^ AllocationExpr buffer
        //
        // buf[...]
        // ^^^  ArrayExpr access
        //
        // buf[...]
        //     ^^^  int accessIdx
        //
        accessIdx = access.getArrayOffset().getValue().toInt() and
        //
        // malloc (100)
        //         ^^^ allocSizeExpr / bufferSize
        //
        allocSizeExpr = buffer.(Call).getArgument(0) and
        // bufferSize = allocSizeExpr.getValue().toInt() and
        //
        // unsigned long size = 100;
        // ...
        // char *buf = malloc(size);
        exists(Expr bufferSizeExpr |
          DataFlow::localExprFlow(bufferSizeExpr, buffer.getSizeExpr()) and
          bufferSizeExpr.getValue().toInt() = bufferSize
          and bse = bufferSizeExpr
        ) and
        // char *buf  = ... buf[0];
        //       ^^^  --->  ^^^
        // or
        // malloc(100);   buf[0]
        // ^^^  --------> ^^^
        //
        DataFlow::localExprFlow(buffer, access.getArrayBase())
      select buffer, access, accessIdx, access.getArrayOffset(), bufferSize, bse
    #+END_SRC

*** Results
    Now, we get 15 results, limited to statically determined values.

   XX: to implement predicates
   =getSourceConstantExpr=, =getFixedSize=, and =getFixedArrayOffset= 
   Use local data-flow analysis to complete the =getSourceConstantExpr=
   predicate. The =getFixedSize= and =getFixedArrayOffset= predicates can
   be completed using =getSourceConstantExpr=.
    
XX:
   1. start with query.
      =elementSize = access.getArrayBase().getUnspecifiedType().(PointerType).getBaseType().getSize()=
   2. convert to predicate.
   3. then use classes, if desired. =class BufferAccess extends ArrayExpr=
      is different from those below.


** Step 5 -- SimpleRangeAnalysis
   Running the query from Step 2 against the database yields a
   significant number of missing or incorrect results. The reason is that
   although great at identifying compile-time constants and their use,
   data-flow analysis is not always the right tool for identifying the
   /range/ of values an =Expr= might have, particularly when multiple
   potential constants might flow to an =Expr=.

   The range analysis already handles conditional branches; we don't
   have to use guards on data flow -- don't implement your own interpreter
   if you can use the library.

   The CodeQL standard library has several mechanisms for addressing this
   problem; in the remainder of this workshop we will explore two of them:
   =SimpleRangeAnalysis= and, later, =GlobalValueNumbering=.

   Although not in the scope of this workshop, a standard use-case for
   range analysis is reliably identifying integer overflow and validating
   integer overflow checks.

   First, simplify the =from...where...select=:
   1. Remove unnecessary =exists= clauses.
   2. Use =DataFlow::localExprFlow= for the buffer and allocation sizes, not
      =getValue().toInt()= 

   Then, add the use of the =SimpleRangeAnalysis= library.  Specifically, the
   relevant library predicates are =upperBound= and =lowerBound=, to be used with
   the buffer access argument.  Experiment and decide which to use for this
   exercise (=upperBound=, =lowerBound=, or both).

   This requires the import
   : import semmle.code.cpp.rangeanalysis.SimpleRangeAnalysis

*** Solution
    #+BEGIN_SRC java :tangle example5.ql
      import cpp
      import semmle.code.cpp.dataflow.DataFlow
      import semmle.code.cpp.rangeanalysis.SimpleRangeAnalysis

      // Step 5
      from
        AllocationExpr buffer, ArrayExpr access, Expr accessIdx, Expr allocSizeExpr, int bufferSize,
        int allocsize, Expr bufferSizeExpr
      where
        // malloc (100)
        // ^^^^^^^^^^^^ AllocationExpr buffer
        //
        // buf[...]
        // ^^^  ArrayExpr access
        //
        // buf[...]
        //     ^^^  int accessIdx
        //
        accessIdx = access.getArrayOffset() and
        //
        // malloc (100)
        //         ^^^ allocSizeExpr / bufferSize
        //
        // Not really:
        //   allocSizeExpr = buffer.(Call).getArgument(0) and
        //
        DataFlow::localExprFlow(allocSizeExpr, buffer.(Call).getArgument(0)) and
        allocsize = allocSizeExpr.getValue().toInt() and
        //
        // unsigned long size = 100;
        // ...
        // char *buf = malloc(size);
        DataFlow::localExprFlow(bufferSizeExpr, buffer.getSizeExpr()) and
        bufferSizeExpr.getValue().toInt() = bufferSize and
        // char *buf  = ... buf[0];
        //       ^^^  --->  ^^^
        // or
        // malloc(100);   buf[0]
        // ^^^  --------> ^^^
        //
        DataFlow::localExprFlow(buffer, access.getArrayBase())
      select buffer, bufferSizeExpr, access, upperBound(accessIdx) as accessMax, accessIdx, allocsize, allocSizeExpr
    #+END_SRC

