session/session.md


<a id="org287ad06"></a>

### Solution

```java
import cpp
import semmle.code.cpp.dataflow.DataFlow

// Step 2
// void test_const(void)
// void test_const_var(void)
from AllocationExpr buffer, ArrayExpr access, int bufferSize, int accessIdx, Expr allocSizeExpr
where
  // malloc (100)
  // ^^^^^^  AllocationExpr buffer
  //
  // buf[...]
  // ^^^  ArrayExpr access
  //
  // buf[...]
  //     ^^^  int accessIdx
  //
  accessIdx = access.getArrayOffset().getValue().toInt() and
  //
  // malloc (100)
  //         ^^^ allocSizeExpr / bufferSize
  //
  allocSizeExpr = buffer.(Call).getArgument(0) and
  bufferSize = allocSizeExpr.getValue().toInt() and
  // char *buf  = ... buf[0];
  //       ^^^  --->  ^^^
  // or
  // malloc(100);   buf[0]
  // ^^^  --------> ^^^
  //
  DataFlow::localExprFlow(buffer, access.getArrayBase())
select buffer, access, accessIdx, access.getArrayOffset(), bufferSize, allocSizeExpr
```


<a id="org4b8509f"></a>

### Results

There are now 3 results. These are from only one function, the one using constants.


<a id="exercise-2"></a>

## Step 3

The previous results need to be extended to the case

```c++
void test_const_var(void)
{
    unsigned long size = 100;
    char *buf = malloc(size);
    buf[0];        // COMPLIANT
    ...
}
```

Here, the `malloc` argument is a variable with known value.

We include this result by removing the size-retrieval from the prior query.


<a id="orga37db88"></a>

### Solution

```java
import cpp
import semmle.code.cpp.dataflow.DataFlow

// Step 3
// void test_const_var(void)
from AllocationExpr buffer, ArrayExpr access, int accessIdx, Expr allocSizeExpr
where
  // malloc (100)
  // ^^^^^^  AllocationExpr buffer
  //
  // buf[...]
  // ^^^  ArrayExpr access
  //
  // buf[...]
  //     ^^^  int accessIdx
  //
  accessIdx = access.getArrayOffset().getValue().toInt() and
  //
  // malloc (100)
  //         ^^^ allocSizeExpr / bufferSize
  //
  allocSizeExpr = buffer.(Call).getArgument(0) and
  // bufferSize = allocSizeExpr.getValue().toInt() and
  // char *buf  = ... buf[0];
  //       ^^^  --->  ^^^
  // or
  // malloc(100);   buf[0]
  // ^^^  --------> ^^^
  //
  DataFlow::localExprFlow(buffer, access.getArrayBase())
select buffer, access, accessIdx, access.getArrayOffset()
```


<a id="org22d1a25"></a>

### Results

Now, we get 12 results, including some from other test cases.


<a id="org493babd"></a>

## Step 4

We are looking for out-of-bounds accesses, so we to need to include the bounds. But in a more general way than looking only at constant values.

Note the results for the cases in `test_const_var` which involve a variable access rather than a constant. The next goal is

1.  to handle the case where the allocation size or array index are variables (with constant values) rather than integer constants.

We have an expression `size` that flows into the `malloc()` call.


<a id="org57d9881"></a>

### Hint


<a id="org9303851"></a>

### Solution

```java
import cpp
import semmle.code.cpp.dataflow.DataFlow

// Step 4
from AllocationExpr buffer, ArrayExpr access, int accessIdx, Expr allocSizeExpr, int bufferSize, Expr bse
where
  // malloc (100)
  // ^^^^^^^^^^^^ AllocationExpr buffer
  //
  // buf[...]
  // ^^^  ArrayExpr access
  //
  // buf[...]
  //     ^^^  int accessIdx
  //
  accessIdx = access.getArrayOffset().getValue().toInt() and
  //
  // malloc (100)
  //         ^^^ allocSizeExpr / bufferSize
  //
  allocSizeExpr = buffer.(Call).getArgument(0) and
  // bufferSize = allocSizeExpr.getValue().toInt() and
  //
  // unsigned long size = 100;
  // ...
  // char *buf = malloc(size);
  exists(Expr bufferSizeExpr |
    DataFlow::localExprFlow(bufferSizeExpr, buffer.getSizeExpr()) and
    bufferSizeExpr.getValue().toInt() = bufferSize
    and bse = bufferSizeExpr
  ) and
  // char *buf  = ... buf[0];
  //       ^^^  --->  ^^^
  // or
  // malloc(100);   buf[0]
  // ^^^  --------> ^^^
  //
  DataFlow::localExprFlow(buffer, access.getArrayBase())
select buffer, access, accessIdx, access.getArrayOffset(), bufferSize, bse
```


<a id="org9ba681e"></a>

### Results

Now, we get 15 results, limited to statically determined values.

XX: Implement predicates `getSourceConstantExpr`, `getFixedSize`, and `getFixedArrayOffset` Use local data-flow analysis to complete the `getSourceConstantExpr` predicate. The `getFixedSize` and `getFixedArrayOffset` predicates can be completed using `getSourceConstantExpr`.

XX:

1.  start with query. `elementSize = access.getArrayBase().getUnspecifiedType().(PointerType).getBaseType().getSize()`
2.  convert to predicate.
3.  then use classes, if desired. `class BufferAccess extends ArrayExpr` is different from those below.


<a id="orgda84218"></a>

## Step 5 &#x2013; SimpleRangeAnalysis

Running the query from Step 2 against the database yields a significant number of missing or incorrect results. The reason is that although great at identifying compile-time constants and their use, data-flow analysis is not always the right tool for identifying the *range* of values an `Expr` might have, particularly when multiple potential constants might flow to an `Expr`.

The range analysis already handles conditional branches; we don't have to use guards on data flow &#x2013; don't implement your own interpreter if you can use the library.

The CodeQL standard library has several mechanisms for addressing this problem; in the remainder of this workshop we will explore two of them: `SimpleRangeAnalysis` and, later, `GlobalValueNumbering`.

Although not in the scope of this workshop, a standard use-case for range analysis is reliably identifying integer overflow and validating integer overflow checks.

First, simplify the `from...where...select`:

1.  Remove unnecessary `exists` clauses.
2.  Use `DataFlow::localExprFlow` for the buffer and allocation sizes, not `getValue().toInt()`

Then, add the use of the `SimpleRangeAnalysis` library. Specifically, the relevant library predicates are `upperBound` and `lowerBound`, to be used with the buffer access argument. Experiment and decide which to use for this exercise (`upperBound`, `lowerBound`, or both).

This requires the import

    import semmle.code.cpp.rangeanalysis.SimpleRangeAnalysis
