session/session.org
*** Results
    Now, we get 48 results.

** Step 6
   To finally determine (some) out-of-bounds accesses, we have to convert
   allocation units (usually in bytes) to size units.  Then we are finally in a
   position to compare buffer allocation size to the access index to find
   out-of-bounds accesses -- at least for expressions with known values.
   
   Add these to the query:
   1. Convert allocation units to size units.
   2. Convert access units to the same size units.

   Hints:
   1. We need the size of the array element.  Use
      =access.getArrayBase().getUnspecifiedType().(PointerType).getBaseType()=
      to see the type and 
      =access.getArrayBase().getUnspecifiedType().(PointerType).getBaseType().getSize()=
      to get its size.

   2. Note from the docs:
      /The malloc() function allocates size bytes of memory and returns a pointer
      to the allocated memory./ 
      So =size = 1=

   3. Note that
      =allocSizeExpr.getUnspecifiedType() as allocBaseType=
      is wrong here.

   4. These test cases all use type =char=.  What would happen for =int= or
      =double=? 

*** Solution
    #+BEGIN_SRC java :tangle example6.ql
      import cpp
      import semmle.code.cpp.dataflow.DataFlow
      import semmle.code.cpp.rangeanalysis.SimpleRangeAnalysis

      // Step 6
      from
        AllocationExpr buffer, ArrayExpr access, Expr accessIdx, Expr allocSizeExpr, int bufferSize,
        int allocsize, Expr bufferSizeExpr
      where
        // malloc (100)
        // ^^^^^^^^^^^^ AllocationExpr buffer
        //
        // buf[...]
        // ^^^  ArrayExpr access
        // buf[...]
        //     ^^^  int accessIdx
        accessIdx = access.getArrayOffset() and
        //
        // malloc (100)
        //         ^^^ allocSizeExpr / bufferSize
        //
        // Not really:
        //   allocSizeExpr = buffer.(Call).getArgument(0) and
        //
        DataFlow::localExprFlow(allocSizeExpr, buffer.(Call).getArgument(0)) and
        allocsize = allocSizeExpr.getValue().toInt() and
        //
        // unsigned long size = 100;
        // ...
        // char *buf = malloc(size);
        DataFlow::localExprFlow(bufferSizeExpr, buffer.getSizeExpr()) and
        bufferSizeExpr.getValue().toInt() = bufferSize and
        // char *buf  = ... buf[0];
        //       ^^^  --->  ^^^
        // or
        // malloc(100);   buf[0]
        // ^^^  --------> ^^^
        //
        DataFlow::localExprFlow(buffer, access.getArrayBase())
      select buffer, bufferSizeExpr, access, upperBound(accessIdx) as accessMax, accessIdx, allocsize, allocSizeExpr,  access.getArrayBase().getUnspecifiedType().(PointerType).getBaseType() as arrayBaseType, access.getArrayBase().getUnspecifiedType().(PointerType).getBaseType().getSize() as arrayTypeSize,  1 as allocBaseSize
    #+END_SRC

*** Results
    48 results in the table

    | 1 | call to malloc | 200 | access to array | 0 | 0 | 200 | 200 | char | 1 | 1 |

** Step 7
   1. Clean up the query.
   2. Add expressions for =allocatedUnits= (from the malloc) and a
      =maxAccessedIndex= (from array accesses)
   3. Compare buffer allocation size to the access index.

*** Solution:
    #+BEGIN_SRC java :tangle example7.ql
      import cpp
      import semmle.code.cpp.dataflow.DataFlow
      import semmle.code.cpp.rangeanalysis.SimpleRangeAnalysis

      // Step 7
      from
        AllocationExpr buffer, ArrayExpr access, Expr accessIdx, Expr allocSizeExpr, int bufferSize,
        int allocsize, Expr bufferSizeExpr, int arrayTypeSize, int allocBaseSize
      where
        // malloc (100)
        // ^^^^^^^^^^^^ AllocationExpr buffer
        //
        // buf[...]
        // ^^^  ArrayExpr access
        // buf[...]
        //     ^^^  int accessIdx
        accessIdx = access.getArrayOffset() and
        //
        // malloc (100)
        //         ^^^ allocSizeExpr / bufferSize
        //
        // Not really:
        //   allocSizeExpr = buffer.(Call).getArgument(0) and
        //
        DataFlow::localExprFlow(allocSizeExpr, buffer.(Call).getArgument(0)) and
        allocsize = allocSizeExpr.getValue().toInt() and
        //
        // unsigned long size = 100;
        // ...
        // char *buf = malloc(size);
        DataFlow::localExprFlow(bufferSizeExpr, buffer.getSizeExpr()) and
        bufferSizeExpr.getValue().toInt() = bufferSize and
        // char *buf  = ... buf[0];
        //       ^^^  --->  ^^^
        // or
        // malloc(100);   buf[0]
        // ^^^  --------> ^^^
        //
        arrayTypeSize =  access.getArrayBase().getUnspecifiedType().(PointerType).getBaseType().getSize() 
        and
        1 = allocBaseSize
        and
        DataFlow::localExprFlow(buffer, access.getArrayBase())
      select buffer, bufferSizeExpr, access, upperBound(accessIdx) as accessMax, allocSizeExpr,   allocBaseSize * allocsize as allocatedUnits, arrayTypeSize * accessMax as maxAccessedIndex
    #+END_SRC

*** Results
    48 results in the much cleaner table

    | no. | buffer         | bufferSizeExpr | access          | accessMax | allocSizeExpr | allocatedUnits | maxAccessedIndex |   |
    |  1 | call to malloc |            200 | access to array |         0 |           200 |            200 |                0 |   |

** Step 8
   1. Clean up the query.
   2. Compare buffer allocation size to the access index.
   3. Report only the questionable entries.
   4. Use
      #+BEGIN_SRC java
        /**
         ,* @kind problem
         ,*/
      #+END_SRC
      to get nicer reporting.

*** Solution:
    #+BEGIN_SRC java :tangle example8.ql
      /**
       ,* @kind problem
       ,*/

      import cpp
      import semmle.code.cpp.dataflow.DataFlow
      import semmle.code.cpp.rangeanalysis.SimpleRangeAnalysis

      // Step 8
      from
        AllocationExpr buffer, ArrayExpr access, Expr accessIdx, Expr allocSizeExpr, int bufferSize,
        int allocsize, Expr bufferSizeExpr, int arrayTypeSize, int allocBaseSize, int accessMax,
        int allocatedUnits, int maxAccessedIndex
      where
        // malloc (100)
        // ^^^^^^^^^^^^ AllocationExpr buffer
        //
        // buf[...]
        // ^^^  ArrayExpr access
        // buf[...]
        //     ^^^  int accessIdx
        accessIdx = access.getArrayOffset() and
        //
        // malloc (100)
        //         ^^^ allocSizeExpr / bufferSize
        //
        // Not really:
        //   allocSizeExpr = buffer.(Call).getArgument(0) and
        //
        DataFlow::localExprFlow(allocSizeExpr, buffer.(Call).getArgument(0)) and
        allocsize = allocSizeExpr.getValue().toInt() and
        //
        // unsigned long size = 100;
        // ...
        // char *buf = malloc(size);
        DataFlow::localExprFlow(bufferSizeExpr, buffer.getSizeExpr()) and
        bufferSizeExpr.getValue().toInt() = bufferSize and
        // char *buf  = ... buf[0];
        //       ^^^  --->  ^^^
        // or
        // malloc(100);   buf[0]
        // ^^^  --------> ^^^
        //
        arrayTypeSize = access.getArrayBase().getUnspecifiedType().(PointerType).getBaseType().getSize() and
        1 = allocBaseSize and
        DataFlow::localExprFlow(buffer, access.getArrayBase()) and
        upperBound(accessIdx) = accessMax and
        allocBaseSize * allocsize = allocatedUnits and
        arrayTypeSize * accessMax =  maxAccessedIndex and
        // only consider out-of-bounds
        maxAccessedIndex >= allocatedUnits
      select access, "Array access at or beyond size; have "+allocatedUnits + " units, access at "+ maxAccessedIndex
    #+END_SRC

