session/session.md


<a id="org696e813"></a>

### Solution:

```java
/**
 * @kind problem
 */

import cpp
import semmle.code.cpp.dataflow.DataFlow
import semmle.code.cpp.rangeanalysis.SimpleRangeAnalysis

// Step 8
from
  AllocationExpr buffer, ArrayExpr access, Expr accessIdx, Expr allocSizeExpr, int bufferSize,
  int allocsize, Expr bufferSizeExpr, int arrayTypeSize, int allocBaseSize, int accessMax,
  int allocatedUnits, int maxAccessedIndex
where
  // malloc (100)
  // ^^^^^^^^^^^^ AllocationExpr buffer
  //
  // buf[...]
  // ^^^  ArrayExpr access
  // buf[...]
  //     ^^^  int accessIdx
  accessIdx = access.getArrayOffset() and
  //
  // malloc (100)
  //         ^^^ allocSizeExpr / bufferSize
  //
  // Not really:
  //   allocSizeExpr = buffer.(Call).getArgument(0) and
  //
  DataFlow::localExprFlow(allocSizeExpr, buffer.(Call).getArgument(0)) and
  allocsize = allocSizeExpr.getValue().toInt() and
  //
  // unsigned long size = 100;
  // ...
  // char *buf = malloc(size);
  DataFlow::localExprFlow(bufferSizeExpr, buffer.getSizeExpr()) and
  bufferSizeExpr.getValue().toInt() = bufferSize and
  // char *buf  = ... buf[0];
  //       ^^^  --->  ^^^
  // or
  // malloc(100);   buf[0]
  // ^^^  --------> ^^^
  //
  arrayTypeSize = access.getArrayBase().getUnspecifiedType().(PointerType).getBaseType().getSize() and
  1 = allocBaseSize and
  DataFlow::localExprFlow(buffer, access.getArrayBase()) and
  upperBound(accessIdx) = accessMax and
  allocBaseSize * allocsize = allocatedUnits and
  arrayTypeSize * accessMax =  maxAccessedIndex and
  // only consider out-of-bounds
  maxAccessedIndex >= allocatedUnits
select access, "Array access at or beyond size; have "+allocatedUnits + " units, access at "+ maxAccessedIndex
```


<a id="org77abe31"></a>

### Results

14 results in the much cleaner table

|                                                              |          |
|------------------------------------------------------------- |--------- |
| Array access at or beyond size; have 200 units, access at 200 | db.c:67:5 |


<a id="org03ebd84"></a>

## Interim notes

A common issue with the `SimpleRangeAnalysis` library is handling of cases where the bounds are undeterminable at compile-time on one or more paths. For example, even though certain paths have clearly defined bounds, the range analysis library will define the `upperBound` and `lowerBound` of `val` as `INT_MIN` and `INT_MAX` respectively:

```cpp
int val = rand() ? rand() : 30;
```

A similar case is present in the `test_const_branch` and `test_const_branch2` test-cases. In these cases, it is necessary to augment range analysis with data-flow and restrict the bounds to the upper or lower bound of computable constants that flow to a given expression. Another approach is global value numbering, used next.


<a id="org29bb594"></a>

## Step 9 &#x2013; GlobalValueNumbering

Range analyis won't bound `sz * x * y`, so switch to global value numbering. This is the case in the last test case,

    void test_gvn_var(unsigned long x, unsigned long y, unsigned long sz)
    {
        char *buf = malloc(sz * x * y);
        buf[sz * x * y - 1]; // COMPLIANT
        buf[sz * x * y];     // NON_COMPLIANT
        buf[sz * x * y + 1]; // NON_COMPLIANT
    }

Reference: <https://codeql.github.com/docs/codeql-language-guides/hash-consing-and-value-numbering/>

Global value numbering only knows that runtime values are equal; they are not comparable (`<, >, <=` etc.), and the *actual* value is not known.

XX: global value numbering finds expressions with the same known value, independent of structure.

So, we look for and use *relative* values between allocation and use. To do this, use GVN.

The relevant CodeQL constructs are

```java
import semmle.code.cpp.valuenumbering.GlobalValueNumbering
...
globalValueNumber(e) = globalValueNumber(sizeExpr) and
e != sizeExpr
...
```

We can use global value numbering to identify common values as first step, but for expressions like

    buf[sz * x * y - 1]; // COMPLIANT

we have to "evaluate" the expressions &#x2013; or at least bound them.


<a id="orgfc8f904"></a>

### interim

```java
/**
 * @ kind problem
 */

import cpp
import semmle.code.cpp.dataflow.DataFlow
import semmle.code.cpp.rangeanalysis.SimpleRangeAnalysis
import semmle.code.cpp.valuenumbering.GlobalValueNumbering

// Step 9
from
  AllocationExpr buffer, ArrayExpr access, Expr accessIdx, Expr allocSizeExpr, int bufferSize,
  int allocsize, Expr bufferSizeExpr, int arrayTypeSize, int allocBaseSize, int accessMax,
  int allocatedUnits, int maxAccessedIndex
where
  // malloc (100)
  // ^^^^^^^^^^^^ AllocationExpr buffer
  //
  // buf[...]
  // ^^^  ArrayExpr access
  // buf[...]
  //     ^^^  int accessIdx
  accessIdx = access.getArrayOffset() and
  //
  // malloc (100)
  //         ^^^ allocSizeExpr / bufferSize
  //
  // Not really:
  //   allocSizeExpr = buffer.(Call).getArgument(0) and
  //
  DataFlow::localExprFlow(allocSizeExpr, buffer.(Call).getArgument(0)) and
  allocsize = allocSizeExpr.getValue().toInt() and
  //
  // unsigned long size = 100;
  // ...
  // char *buf = malloc(size);
  DataFlow::localExprFlow(bufferSizeExpr, buffer.getSizeExpr()) and
  bufferSizeExpr.getValue().toInt() = bufferSize and
  // char *buf  = ... buf[0];
  //       ^^^  --->  ^^^
  // or
  // malloc(100);   buf[0]
  // ^^^  --------> ^^^
  //
  arrayTypeSize = access.getArrayBase().getUnspecifiedType().(PointerType).getBaseType().getSize() and
  1 = allocBaseSize and
  DataFlow::localExprFlow(buffer, access.getArrayBase()) and
  upperBound(accessIdx) = accessMax and
  allocBaseSize * allocsize = allocatedUnits and
  arrayTypeSize * accessMax = maxAccessedIndex and
  // only consider out-of-bounds
  maxAccessedIndex >= allocatedUnits
select access,
  "Array access at or beyond size; have " + allocatedUnits + " units, access at " + maxAccessedIndex,
  globalValueNumber(accessIdx) as gvnAccess, globalValueNumber(allocSizeExpr) as gvnAlloc
```


<a id="org53cf2e1"></a>

### interim

Messy, start over.

```java
import cpp
import semmle.code.cpp.dataflow.DataFlow
import semmle.code.cpp.rangeanalysis.SimpleRangeAnalysis
import semmle.code.cpp.valuenumbering.GlobalValueNumbering

// Step 9
from
  AllocationExpr buffer, ArrayExpr access, Expr accessIdx, Expr allocSizeExpr, GVN gvnAccess,
  GVN gvnAlloc
where
  // malloc (100)
  // ^^^^^^^^^^^^ AllocationExpr buffer
  //
  // buf[...]
  // ^^^  ArrayExpr access
  // buf[...]
  //     ^^^ accessIdx
  accessIdx = access.getArrayOffset() and
  //
  // malloc (100)
  //         ^^^ allocSizeExpr / bufferSize
  // unsigned long size = 100;
  // ...
  // char *buf = malloc(size);
  DataFlow::localExprFlow(allocSizeExpr, buffer.getSizeExpr()) and
  // char *buf  = ... buf[0];
  //       ^^^  --->  ^^^
  // or
  // malloc(100);   buf[0]
  // ^^^  --------> ^^^
  //
  DataFlow::localExprFlow(buffer, access.getArrayBase()) and
  //
  // Use GVN
  globalValueNumber(accessIdx) = gvnAccess and
  globalValueNumber(allocSizeExpr) = gvnAlloc and
  (
    gvnAccess = gvnAlloc
    or
    // buf[sz * x * y] above
    // buf[sz * x * y + 1];
    exists(AddExpr add |
      accessIdx = add and
      // add.getAnOperand() = accessIdx and
      add.getAnOperand().getValue().toInt() > 0 and
      globalValueNumber(add.getAnOperand()) = gvnAlloc
    )
  )
select access, gvnAccess, gvnAlloc
```


<a id="org7ccef88"></a>

## TODO hashcons

import semmle.code.cpp.valuenumbering.HashCons

hashcons: every value gets a number based on structure. Fails on

    char *buf = malloc(sz * x * y);
    sz = 100;
    buf[sz * x * y - 1]; // COMPLIANT

The final exercise is to implement the `isOffsetOutOfBoundsGVN` predicate to [&#x2026;]
